{"article": "Patrons crowd the platform at the Washington Metropolitan Area Transit Authority's (WMATA) Metro Center stop in Washington, D.C. on Dec. 20, 2004. Thousands use the public transit system daily to get them in and around the D.C. area. (Karen Bleier/AFP/Getty Images)\nUS Senators Threaten Metro Funding Over Chinese Manufacturer\nWASHINGTON —Federal lawmakers say they’ll approve badly needed funding for Washington’s transit system, but only if it avoids buying new rail cars from China.\nThe Washington Post reported on April 13 that U.S. Senators from Virginia and Maryland proposed the idea in new legislation. It reflects growing concerns that China’s state-owned rail company could hurt American manufacturers and make the system vulnerable to cyber espionage.\nDave Smolensky, spokesman for the China Railway Rolling Stock Corp, dismissed the espionage concerns. The company also said the United States should be promoting competition.\nThe company has won four major U.S. rail car contracts. It is pursuing a Metro contract worth more than $1 billion to build up to 800 of the new rail cars.\nThere are no U.S. transit rail car manufacturers. The bidding deadline is May 31.\n", "domain": "theepochtimes.com", "title": "US Senators Threaten Metro Funding Over Chinese Manufacturer", "date": "April 15, 2019", "authors": null, "ind30k": 29363, "url": "https://www.theepochtimes.com/us-senators-threaten-metro-funding-over-chinese-manufacturer_2880764.html", "label": "human", "orig_split": "train_burner", "split": "train", "random_score": -4.26355665680627}
{"article": "Transparent may have been renewed for a third season on Amazon just last week, but Jeffrey Tambor‘s character is already getting the ax. In a musical send-off for its beloved trans character Maura Pfefferman, the show is planning a short episode where fans will bid farewell to Maura and the Pfefferman family by serenading her with a song.\nAlong with news that Transparent will be renewed for a third season in the near future, Amazon announced that it will hold an aftershow in which fans will share memories and songs in honor of the show’s aging lead character Maura Pfefferman.\nTransparent: We Know Goodbye\nFollowing the episode “We Know Goodbye,” viewers will get to watch fans reminisce about the beloved character, who was introduced in the third season as her father Mort in the show’s first episode. The short episode will culminate with a rendition of “I Won’t Hate You Anymore,” a hit in 1984’s Coming To America. And yes, it was originally the song performed by Eddie Murphy in the Eddie Murphy film that inspired the Transparent song:\nAmazon’s synopsis for the episode read:\nIn what will be the final episode of the show, Maura (Jeffrey Tambor) bids farewell to her family as she fades away into memory. With memories of their first encounter (and their shared encounter with God) the cast and crew create a musical play, complete with tears, solos, duets, a song about Mufasa (aka she has sex with a gorilla), and a comedic karaoke extravaganza.\nFans have shared their favorite moments from Transparent throughout the past two seasons and will now be able to make those memories in person.\nThis isn’t the first time that Amazon has launched an aftershow, following in the footsteps of Transparent‘s much buzzed-about aftershow “20% Somethings.” It’s a neat move for a show that has been so beloved, and for fans that are so attached to the Pfefferman family.\nDana Brunetti, Netflix’s executive producer and the company’s movie division heads, once told the Hollywood Reporter that Netflix now limits the amount of hours Netflix subscribers can watch an entire season of their favorite shows:\nIt used to be that you had to watch the whole season, but now it’s maxed out at a certain time. If you want to watch the whole season of House of Cards in one night, you have to wait at least a week. Now that we’re more selective with what we give out on this balance, people are getting more time with their favorite shows.\nI guess we can thank Netflix for forcing us to wait weeks to binge on all the great TV shows we love. Though I wouldn’t mind picking up a shopping cart for the Netflix app as we wait.\n", "domain": "slashfilm.com", "title": "‘Transparent’ to Kill Off Jeffrey Tambor’s Character in Musical Finale", "date": "April 11, 2019", "authors": "Hoai-Tran Bui", "ind30k": 4999, "url": "https://www.slashfilm.com/transparent-jeffrey-tambor-dead-finale/", "label": "machine", "orig_split": "gen", "top_p": 0.9396825396825397, "split": "train"}
{"article": "In December 2018 the issue of why the Canadian government declined to purchase a second interim supply ship – a sister ship to MV Asterix which is currently at sea supporting Royal Canadian Navy operations – became a source of debate in the Commons.\nConservative leader Andrew Scheer questioned the Liberal government why it was not moving ahead with having Davie provide the second supply ship, the Obelix, to the navy. Scheer said the navy needed the second ship.\nBut Prime Minister Justin Trudeau accused Scheer of playing “petty politics.”\n“The armed forces did an assessment,” Trudeau explained. “They don’t need the Obelix and for him to suggest that we should buy it anyway is pure base politics, the worst politics. We make our decisions based on facts. We recognize the quality of work done by Davie shipyard and we do want them to get good jobs but we are not going to make up work for political reasons.”\nIn February, the Conservatives again went after the issue of the second supply ship and questioned whether the assessment referred to by Trudeau even existed.\nThat is a good question.\nWhen asked about the issue the RCN noted in an email Dec. 20, 2018 to Defence Watch that in November 2014, the navy outlined the high level requirements for an interim AOR capability in a document entitled: Interim AOR (iAOR) – High Level Requirements (HLRs). “The specific requirement was detailed in terms of the number of sea days per year and a certain set of key capabilities to be provided, the RCN noted in its email. “This requirement was intended to meet the RCN needs while progress was made on the Joint Support Ship project which will deliver two JSS PROTECTEUR Class ships as directed in the defence policy Strong, Secure, Engaged. There has been no change to the RCN requirements.”\nDefence Watch reviewed that 2014 document and it does not discuss a second interim supply ship, let alone rule out the need for a second vessel. It continually refers to the criteria for a single supply ship.\nThere are also a number of other factors to consider here. On May 30 2018, Vice Admiral Darren Hawco testified before the Senate’s National Finance Committee. He stated: “We never really looked at the need for or validated the need for a second interim AOR.”\nDavie officials argue the Liberal’s own Strong Secure and Engaged defence policy points to the need for that second ship. The policy calls for two supply ships, one on each coast, operating simultaneously. Currently there is only one ship, MV Asterix. The first new Joint Support Ship isn’t expected for another four years.\nDavie also noted that the money for a second ship is available, pointing out that the Department of National Defence lapsed between $2 billion to $3 billion in 2017/2018. The second supply ship is being offered by Davie for $500 million.\nScheer has committed to building a second interim supply ship if his party forms the next government.\nSome further background reading:\nhttps://ottawacitizen.com/news/national/defence-watch/the-case-for-a-second-interim-resupply-ship-new-stats-show-how-foreign-navies-continue-to-refuel-canadian-navy-ships\n(Analysis)\n", "domain": "ottawacitizen.com", "title": "Military assessment ruling out the need for a second interim supply ship doesn’t appear to exist", "date": "April 16, 2019", "authors": "Updated", "ind30k": 23090, "url": "https://ottawacitizen.com/news/national/defence-watch/military-assessment-supposedly-ruling-out-a-second-interim-supply-ship-doesnt-appear-to-exist", "label": "human", "orig_split": "train_burner", "split": "train", "random_score": -3.8636238954221143}
{"article": "Modi also said the opposition wants to strip the armed forces of their special powers, while the NDA government strives to give full liberty to jawans to deal with terrorists and Naxals. (Image: ANI twitter)\nBhagalpur: Prime Minister Narendra Modi on Thursday launched a scathing attack on the Congress-led opposition, asserting that the \"mahamilavati gang\" is scared that if he comes to power again, their \"shops\" of corruption and dynasty politics will shut down.\nAddressing an election rally here, Modi also said the opposition wants to strip the armed forces of their special powers, while the NDA government strives to give full liberty to jawans to deal with terrorists and Naxals. \"The mahamilavati gang is actually afraid of something else though it may have other pretensions while scaremongering. They fear that if Modi comes to power again, their shops of corruption, dynasty politics and venal defence deals will shut down,\" he said.\nThe Prime Minister said his government has been making efforts to bolster the quota system introduced by Baba Saheb Ambedkar. \"They are saying that if Modi comes to power again, elections would be done away with. All constitutional bodies will be under threat. And reservations will be done away with. \"The fact remains, this 'chowkidar' of yours has been making all efforts to strengthen the quota system introduced by Baba Saheb Ambedkar,\" Modi said.\nBihar will witness a seven-phase polling for its 40 Lok Sabha seats.\nKeep yourself updated on Lok Sabha Elections 2019 with our round-the-clock coverage -- breaking news, updates, analyses et all. Happy reading.\n", "domain": "deccanchronicle.com", "title": "Mahamilavat gang scared I will shut their shops of corruption if back in power: Modi", "date": "April 11, 2019", "authors": null, "ind30k": 28881, "url": "https://www.deccanchronicle.com/nation/politics/110419/opposition-scared-indulging-in-scaremongering-modi.html", "label": "human", "orig_split": "train_burner", "split": "train", "random_score": -3.8137245194108234}
